# 工具
brew "bat"
brew "btop"
brew "colordiff"
brew "ffmpeg"
brew "hugo"
brew "imagemagick"
brew "smartmontools"
brew "telegram-downloader"
brew "yt-dlp"
# 程式開發
brew "cmake"
brew "go"
brew "gf" # GoFrame
brew "filosottile/musl-cross/musl-cross"
brew "node"
brew "python@3.14"
brew "uv"

# Cask (GUI apps)
cask "altserver"
cask "appcleaner"
cask "balenaetcher"
cask "betterdisplay"
cask "discord"
cask "font-hack-nerd-font"
cask "ghostty"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "iina"
cask "inkscape"
# cask "jordanbaird-ice"
cask "jordanbaird-ice@beta"
cask "keka"
cask "logitech-g-hub"
cask "mongodb-compass"
cask "motrix"
cask "musicbrainz-picard"
cask "openinterminal"
cask "orbstack"
cask "outline-manager"
cask "phpstorm"
cask "protonvpn"
cask "pycharm"
cask "rapidapi"
cask "raycast"
cask "scroll-reverser"
cask "slack"
cask "stats"
cask "telegram"
cask "visual-studio-code"
cask "webstorm"
cask "yubico-yubikey-manager"
cask "zen"

# App Store
brew "mas"
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835